000_РОЗНИЦА_ЦЕНТР/src/Documents/КорректировкаЛистаЖеланий/КорректировкаЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЛистаЖеланий</name>
  <registerRecords>AccumulationRegister.ЛистыЖеланий</registerRecords>
  <registerRecords>InformationRegister.СостояниеЛистаЖеланий</registerRecords>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>CatalogRef.АнкетаЛистаЖеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>Корзина</name>
    <type>
      <types>CatalogRef.КорзиныЛистаЖеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируемыйДокумент</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.ОперацияЛистаЖеланий</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ЛистыЖеланий/ЛистыЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛистыЖеланий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацияЛистаЖеланий</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛистЖеланий</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корзина</name>
    <type>
      <types>CatalogRef.КорзиныЛистаЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/КорректировкаЛистаЖеланий/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура РедактируемыйДокументПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛистыЖеланийОстатки.Магазин,
	|	ЛистыЖеланийОстатки.ЛистЖеланий,
	|	ЛистыЖеланийОстатки.Корзина,
	|	ЛистыЖеланийОстатки.Номенклатура,
	|	ЛистыЖеланийОстатки.Характеристика,
	|	ЛистыЖеланийОстатки.КоличествоОстаток как Количество
	|ИЗ
	|	РегистрНакопления.ЛистыЖеланий.Остатки(, ЛистЖеланий = &ЛистЖеланий) КАК ЛистыЖеланийОстатки";
	
	Запрос.УстановитьПараметр("ЛистЖеланий", Объект.РедактируемыйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйДокументПриИзменении(Элемент)
	РедактируемыйДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01

КонецПроцедуры
